In [ ]:
!pip3 install pandas

In [ ]:
!pip3 install pymysql

In [ ]:
import pandas as pd
import pymysql

In [2]:
conn1 = pymysql.connect(
    host='127.0.0.1',
    port=int(3306),
    user="root",
    password="****", #your own password of mysql
    db = 'dbname',
    charset='utf8mb4'
    ) # Connection string

In [3]:
cursorobj = conn1.cursor()
createquery = "create table product (product_name varchar(40), rate_of_int float, max_ten_months int, min_ten_months int, is_active char(5))"
cursorobj.execute(createquery)

0

In [4]:
new_query = "show tables"
cursorobj.execute(new_query)
rows = cursorobj.fetchall()
rows

(('product',),)

In [5]:
insert_query ="insert into product values('Personal loan',12.5,6,24,'Yes')"
cursorobj.execute(insert_query)

1

In [6]:
read_query = "select * from product"
cursorobj.execute(read_query)
rows = cursorobj.fetchall()
rows

(('Personal loan', 12.5, 6, 24, 'Yes'),)

In [8]:
import warnings
warnings.filterwarnings(action='ignore')

In [7]:
df = pd.read_sql_query(read_query,conn1)
df

    product_name  rate_of_int  max_ten_months  min_ten_months is_active
0  Personal loan         12.5               6              24       Yes

In [9]:
pred_name = input("Enter product name: ")
roi = float(input("Enter rate of interest "))
max_ten = int(input("Enter maximum tenure in months "))
min_ten = int(input("Enter minimum tenure in months "))
active = input("Is the product active(Yes/No) ")

Enter product name: Home Loan
Enter rate of interest 10.5
Enter maximum tenure in months 120
Enter minimum tenure in months 60
Is the product active(Yes/No) Yes

In [10]:
insert_query = "insert into product values(%s, %s, %s, %s, %s)"
values = (pred_name,roi,max_ten,min_ten,active)
cursorobj.execute(insert_query, values)

1

In [11]:
read_query = "select * from product"
df= pd.read_sql_query(read_query,conn1)
df

    product_name  rate_of_int  max_ten_months  min_ten_months is_active
0  Personal loan         12.5               6              24       Yes
1      Home Loan         10.5             120              60       Yes

In [12]:
def read_data(query,con):
    df = pd.read_sql_query(query,con)
    return df

In [13]:
## Display only active products
sql_query = "select * from product where is_active = 'Yes'"
df = read_data(sql_query,conn1)
df

    product_name  rate_of_int  max_ten_months  min_ten_months is_active
0  Personal loan         12.5               6              24       Yes
1      Home Loan         10.5             120              60       Yes

In [15]:
# Display the product with rate of interest > 10
query = "select * from product where rate_of_int>10"
df = read_data(query,conn1)
df

    product_name  rate_of_int  max_ten_months  min_ten_months is_active
0  Personal loan         12.5               6              24       Yes
1      Home Loan         10.5             120              60       Yes

In [16]:
## Display rate of interest for home loan
sql_query = "select rate_of_int from product where product_name = 'Home Loan'"
df = read_data(sql_query, conn1)
df

   rate_of_int
0         10.5

In [ ]:
df.info()

In [17]:
# Change the rate of interest for personal loan to 16%
update_query = "update product set rate_of_int = 16 where product_name = 'Personal Loan'"
cursorobj.execute(update_query)

1

In [19]:
cursorobj.execute("commit")

0

In [18]:
read_query = "select * from product"
df= pd.read_sql_query(read_query,conn1)
df

    product_name  rate_of_int  max_ten_months  min_ten_months is_active
0  Personal loan         16.0               6              24       Yes
1      Home Loan         10.5             120              60       Yes

In [ ]:
df.info()

In [20]:
# delete the row of home loan
del_query = "delete from product where product_name = 'Home Loan'"
cursorobj.execute(del_query)

1

In [21]:
read_query = "select * from product"
df= pd.read_sql_query(read_query,conn1)
df

    product_name  rate_of_int  max_ten_months  min_ten_months is_active
0  Personal loan         16.0               6              24       Yes

In [ ]:
cursorobj = conn1.cursor()
createquery = "create table trans(tid int primary key, ttime datetime, accno int, amount float, constraint t_fk foreign key(accno) references accounts(account_no))"
cursorobj.execute(createquery)

In [ ]:
query = "show tables"
cursorobj.execute(query)
rows = cursorobj.fetchall()
rows

In [ ]:
cursorobj = conn1.cursor()
createquery = "drop table product"
cursorobj.execute(createquery)

In [ ]:
query = "show tables"
cursorobj.execute(query)
rows = cursorobj.fetchall()
rows